too1/nrf52-ble-app-uart-error-resources/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') ||
                (data_array[index - 1] == '\r') ||
                (index >= m_ble_nus_max_data_len))
            {
                if (index > 1)
                {
                    NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                    NRF_LOG_HEXDUMP_DEBUG(data_array, index);

                    do
                    {
                        uint16_t length = (uint16_t)index;
                        err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                        if ((err_code != NRF_ERROR_INVALID_STATE) &&
                            (err_code != NRF_ERROR_RESOURCES) &&
                            (err_code != NRF_ERROR_NOT_FOUND))
                        {
                            APP_ERROR_CHECK(err_code);
                        }
                    } while (err_code == NRF_ERROR_RESOURCES);
                }

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

// Create a FIFO structure
app_fifo_t dummy_fifo;

uint32_t dummy_fifo_bytes_used;

// Create a buffer for the FIFO
#define DUMMY_FIFO_SIZE 512
uint8_t dummy_buffer[DUMMY_FIFO_SIZE];

static int dummy_buffer_write(uint8_t *data, uint32_t len)
{
    app_fifo_write(&dummy_fifo, data, &len);
    dummy_fifo_bytes_used += len;
    return len;
}

static int dummy_buffer_bytes_free(void)
{
    return DUMMY_FIFO_SIZE - dummy_fifo_bytes_used;
}

static int dummy_buffer_read(uint8_t *data, uint32_t len)
{
    app_fifo_read(&dummy_fifo, data, &len);
    dummy_fifo_bytes_used -= len;
    return len;
}

static int dummy_buffer_bytes_used(void)
{
    return dummy_fifo_bytes_used;
}

static void init_dummy_buffer(void)
{
    // Initialize FIFO structure
    uint32_t err_code = app_fifo_init(&dummy_fifo, dummy_buffer, DUMMY_FIFO_SIZE);
    APP_ERROR_CHECK(err_code);

    dummy_fifo_bytes_used = 0;
}

static void simulated_dummy_data_read(uint8_t *data, uint32_t len)
{
    static uint8_t data_counter = 'a';
    for(int i = 0; i < len; i++)
    {
        data[i] = data_counter++;
        if(data_counter > 'z') data_counter = 'a';
    }

    // Simulate that the read operation takes some time to complete, by adding a blocking delay
    //nrf_delay_ms(2);
}

#define TEST_DUMP_SIZE 4096
#define TEST_READ_SIZE 128
#define TEST_WRITE_SIZE 20//m_ble_nus_max_data_len
uint32_t dummy_test_remaining_bytes_read = 0;
uint32_t dummy_test_remaining_bytes_write = 0;

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    uint32_t err_code;

    // Initialize.
    uart_init();
    log_init();
    nrf_gpio_cfg_output(LED_1);
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    init_dummy_buffer();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

    static uint8_t tmp_read_buffer[TEST_READ_SIZE];
    static uint8_t tmp_write_buffer[244];
    uint16_t write_length;
    int bt_written;

    // Enter main loop.
    for (;;)
    {
        // If the run_dummy_test flag is set, start a new data dump test
        if(run_dummy_test) 
        {
            run_dummy_test = false;
            bt_written = 0;
            dummy_test_remaining_bytes_read = TEST_DUMP_SIZE;
        }

        // As long as there are bytes left to read, and there is room in the dummy buffer, read out a single packet
        if(dummy_test_remaining_bytes_read && dummy_buffer_bytes_free() >= TEST_READ_SIZE)
        {
            uint32_t read_length = (dummy_test_remaining_bytes_read > TEST_READ_SIZE) ? TEST_READ_SIZE : dummy_test_remaining_bytes_read;
            simulated_dummy_data_read(tmp_read_buffer, read_length);
            dummy_buffer_write(tmp_read_buffer, read_length);
            dummy_test_remaining_bytes_read -= read_length;
            //NRF_LOG_INFO("Dummy data produced %i, remaining %i", read_length, dummy_test_remaining_bytes_read);
        }

        // As long as there is data in the dummy buffer, and the Bluetooth stack has free buffers, upload a packet
        if(ble_buffers_available && (dummy_buffer_bytes_used() > 0 || retransmit_previous_buffer))
        {
            nrf_gpio_pin_clear(LED_1);
            if(!retransmit_previous_buffer)
            {
                write_length = dummy_buffer_read(tmp_write_buffer, TEST_WRITE_SIZE);
                //NRF_LOG_INFO(" Fifo to tmp %i bytes", write_length);
            } 

            // 
            err_code = ble_nus_data_send(&m_nus, tmp_write_buffer, &write_length, m_conn_handle);
            if(err_code == NRF_SUCCESS)
            {
                bt_written += write_length;
                //NRF_LOG_INFO("   Tmp to BT total: %i (+%i)", bt_written, write_length);
            }
            else if(err_code == NRF_ERROR_RESOURCES) 
            {
                ble_buffers_available = false;
                nrf_gpio_pin_set(LED_1);
                //NRF_LOG_INFO("     ERROR RESOURCES");
            }
            else if(err_code != NRF_ERROR_INVALID_STATE && err_code != NRF_ERROR_NOT_FOUND)
            {
                APP_ERROR_CHECK(err_code);
            }

            retransmit_previous_buffer = false;

            if(bt_written == TEST_DUMP_SIZE) 
            {
                NRF_LOG_INFO("Test complete!");
            }
        }

        idle_state_handle();
    }
}


/**
 * @}
 */
